In [1]:
import pandas as pd
import requests
from bs4 import BeautifulSoup

In [2]:
response = requests.get('https://btech-data-analytics.github.io/bridgerland-technical-college/employees_3.html').text

In [3]:
soup = BeautifulSoup(response , 'html.parser')

In [4]:
soup.find('table').find_all('tr', class_='employee')[0].find_all('td')[1].text

'John Doe'

In [8]:
id = []
name = []
age = []

for employee in soup.find('table').find_all('tr', class_='employee'):
    id.append(employee.find_all('td')[0].text)
    name.append(employee.find_all('td')[1].text)
    age.append(employee.find_all('td')[2].text)

In [12]:
df = pd.DataFrame({
    'id': id,
    'name': name, 
    'age': age
})
df.head()

    id            name age
0  101        John Doe  28
1  102      Jane Smith  32
2  103  Robert Johnson  24
3  104    Mary Johnson  29
4  105   Michael Brown  35

In [17]:
df['age'] = pd.to_numeric(df['age'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      object
 1   name    8 non-null      object
 2   age     8 non-null      int64
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [18]:
df.describe()

             age
count   8.000000
mean   29.875000
std     3.563205
min    24.000000
25%    27.750000
50%    30.000000
75%    32.250000
max    35.000000